//สอบกลางภาค 662
//ตัวแปรส่วนโครงสร้างข้อสอบ
var ex = []
var  a = []
var  b = []
var  c = []
var  d = []

//ตัวแปรในข้อสอบแต่ละข้อ
var l = []
var m = []
var n = []
var o = []
var r = []
var x = []
var y = []
var z = []

//1 `
let i=0
m[i] = random(1, 9)*100
   ex[i] = "การกระทำในตัวเลือกใดเป็นการทดลองสุ่ม"
    a[i] = "การออกหมายเลขสลากกินแบ่งที่ได้รับรางวัลโดยการหมุนวงล้อให้ลูกปิงปองที่มีตัวเลขออกมาจากวงล้อ"
    b[i] = "การคัดส้มที่ไม่มีตาหนิออกจากกองส้มซึ่งมีส้มทั้งหมด "+m[i]+" ผล"
    c[i] = "การทดลองเปรียบเทียบการงอกของเมล็ดถั่ว เมื่อรดน้าในปริมาณต่างๆ กัน"
    d[i] = "การสอบคัดเลือกนักเรียนที่มีความสามารถทางคณิตศาสตร์จากนักเรียนทั่วประเทศ"

//2 `
i++
m[i] = random(2, 9)*10
n[i] = random(2, 9)*100
  ex[i] = "เหตุการณ์ในข้อใดที่เป็นไปไม่ได้"
   a[i] = "ภากรหยิบสลากซึ่งเป็นจานวนที่มีสองหลักขึ้นมา 1 ใบ ซึ่งมีผลบวกของเลขโดดในหลักทั้งสองเท่ากับ "+m[i]
   b[i] = "เพาะเมล็ดถั่วเหลือง "+n[i]+" เมล็ด แต่ไม่มีเมล็ดใดงอกเลย"
   c[i] = "เมื่อแมวออกลูกครั้งแรกและครั้งที่สองเป็นตัวผู้ ในการออกลูกครั้งที่สามย่อมเป็นตัวผู้อีก"
   d[i] = "กอบชัยไม่ชอบสีเหลืองแต่ในสัปดาห์นี้เขาสวมใส่เสื้อสีเหลืองทุกวัน"

 //3 `
 i++
   m[i] = random(2, 9)
  ex[i] = "เหตุการณ์ในข้อใดที่เกิดขึ้นอย่างแน่นอน"
   a[i] = "ในกล่องใบหนึ่งมีลูกแก้วสีแดง "+m[i]+" ลูก สีเหลือง 1 ลูก ถ้าหยิบลูกแก้วขึ้นมาพร้อมกันสองลูก จะได้ลูกแก้วสีแดงอย่างน้อย 1 ลูก"
   b[i] = "นารีและมีนาเรียนหนังสืออยู่ชั้นเดียวกัน เขาจึงมีอายุเท่ากัน"
   c[i] = "ในการเรียงเลขโดดสามตัว คือ 1, 2, 3 จะได้จำนวนที่มีค่าไม่เกิน 300 เสมอ"
   d[i] = "ในการดึงไพ่ 1 ใบ ออกจากไพ่หนึ่งสำรับ จะได้ไพ่ Q  โพดำ"

 //4 `
 i++
  ex[i] = "ในการทอดลูกเต๋า 2 ลูกพร้อมกัน 1 ครั้ง เหตุการณ์ที่จะได้ผลรวมของแต้มบนหน้าลูกเต๋าทั้งสองเท่ากับ 6 คือ ข้อใด"
   a[i] = "`(1, 5), (2, 4), (3, 3), (4, 2), (5, 1)`"
   b[i] = "`(0, 6), (1, 5), (2, 4), (3, 3), (4, 2), (5, 1), (6, 0)`"
   c[i] = "`(0, 6), (1, 5), (2, 4), (3, 3)`"
   d[i] = "`(1, 5), (2, 4), (3, 3)`"

 //5 `
 i++
  ex[i] = "ในการสุ่มหยิบลูกอม 2 เม็ดพร้อมกัน จากถ้วยกระเบื้องซึ่งมีลูกอมสีเขียว 2 เม็ด สีแดง 1 เม็ด ผลที่เกิดขึ้นทั้งหมดคือข้อใด เมื่อให้ `ข_1, ข_2` คือลูกอมสีเขียว และ ด คือลูกอมสีแดง โดยไม่สนใจลำดับที่ของลูกอมที่หยิบได้"
   a[i] = "`(ข_1, ข_2), (ข_1, ด), (ข_2, ด)`"
   b[i] = "`(ข_1, ด), (ข_2, ด)`"
   c[i] = "`(ข_1, ข_2)`"
   d[i] = "`(ด, ด)`"

  //6 `
  i++
  l[i] = random(2, 9)
  m[i] = random(2, 9)
  n[i] = random(2, 9)
  ex[i] = "ชายคนหนึ่งมีเสื้อ `"+l[i]+"` ตัวสีต่างกัน กางเกง `"+m[i]+"` ตัวสีต่างกัน และรองเท้า `"+n[i]+"` คู่สีต่างกัน จงหาจำนวนวิธีทั้งหมดที่ชายคนนี้"
   a[i] = "`"+(l[i]*m[i]*n[i])+"\\ `วิธี"
   b[i] = "`"+(l[i]+m[i]+n[i])+"\\ `วิธี"
   c[i] = "`"+(l[i]*m[i]+n[i]+10)+"\\ `วิธี"
   d[i] = "`"+(l[i]+m[i]*n[i]+20)+"\\ `วิธี"
  
  //7 `
  i++
  m[i] = random(2, 4)
  n[i] = random(7, 9)
  ex[i] = "จำนวนวิธีที่ผู้โดยสาร `"+m[i]+"` คน จะนั่งที่นั่งว่าง `"+n[i]+"` ที่ตรงกับข้อใด"
   a[i] = "`"+Pnr(n[i],m[i]).toLocaleString()+"\\ `วิธี"
   b[i] = "`"+Cnr(n[i],m[i]).toLocaleString()+"\\ `วิธี"
   c[i] = "`"+(n[i]*m[i]).toLocaleString()+"\\ `วิธี"
   d[i] = "`"+nFact(m[i]).toLocaleString()+"\\ `วิธี"
  
  //8 `
  i++
    m[i] = random(4, 9)
    n[i] = random(1, 7)
    m[i] == n[i] ? n[i]=n[i]-2 : null
    m[i] < n[i] ? m[i] = n[i]+1 : null
    let s = m[i]-n[i]+1
   ex[i] = "สร้างเลขจำนวนที่มี 3 หลัก โดยใช้ตัวเลข `"+numAllDp(m[i],",")+"` (ไม่ใช้ตัวเลขซ้ำกัน) ให้มีค่ามากกว่า `"+(n[i]*100)+"` จะสร้างได้ทั้งหมดกี่จำนวน"
    a[i] = "`"+(s*(m[i]-1)*(m[i]-2))+"`"
    b[i] = "`"+m[i]*n[i]+"`"
    c[i] = "`"+((m[i]-1)*(m[i]-2)*m[i]-3)+"`"
    d[i] = "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
  
  //9 `
  i++
  m[i] = random(5, 9)
  n[i] = random(2, 4)
  r[i] = random(2, 4)
  n[i] == r[i] ? n[i]=n[i]+2 : null
  n[i]+r[i] == m[i] ? n[i]=n[i]-1 : null
  ex[i] = "กำหนดให้ `C_(n,"+n[i]+")="+Cnr(m[i],n[i]).toLocaleString()+"` และ `P_(n,r)="+Pnr(m[i],r[i]).toLocaleString()+"` จงหาค่า r"
   a[i] = "`"+r[i]+"`"
   b[i] = "`"+m[i]+"`"
   c[i] = "`"+n[i]+"`"
   d[i] = "`"+(n[i]+r[i])+"`"
  
  //10 `
  i++
    m[i] = random(5, 10)
    ex[i]= "จงหาค่า n เมื่อ `n(n - 1)(n - 2) = "+m[i]*(m[i]-1)*(m[i]-2)+"`"
    a[i]= "`"+m[i]+"`"
    b[i]= "`"+(m[i]-1)+"`"
    c[i]= "`"+(m[i]+2)+"`"
    d[i]= "`"+(m[i]+1)+"`"
  
  //11 `
  i++
    m[i] = random(4, 5)
    n[i] = random(1, 5)*10
    ex[i]= "ข้อสอบฉบับหนึ่งเป็นแบบปรนัย `"+m[i]+"` ตัวเลือกมีจำนวน `"+n[i]+"` ข้อ จงหาจำนวนวิธีที่จะทำข้อสอบทั้งหมด"
    a[i]= "`"+m[i]+"^"+n[i]+"`"
    b[i]= "`"+m[i]+"xx"+n[i]+"`"
    c[i]= "`"+n[i]+"^"+m[i]+"`"
    d[i]= "`P_("+n[i]+","+m[i]+")`"

  //12 `
  i++
    x[i] = random(4, 8)
    y[i] = random(4, 8)
    ex[i]= "จงหา `x + y` เมื่อ `x! = "+nFact(x[i]).toLocaleString()+"` และ `y! ="+nFact(y[i]).toLocaleString()+"`"
    a[i]= "`"+(x[i]+y[i])+"`"
    b[i]= "`"+(x[i]+y[i]+5)+"`"
    c[i]= "`"+(x[i]+y[i]+10)+"`"
    d[i]= "`"+(x[i]+y[i]-2)+"`"

  //13 `
  i++
    m[i] = random(7, 15)
    ex[i]= "จงหาค่า `n` เมื่อ `n(n-1)(n-2) = "+m[i]*(m[i]-1)*(m[i]-2)+"`"
    a[i]= "`"+m[i]+"`"
    b[i]= "`"+(m[i]+1)+"`"
    c[i]= "`"+(m[i]-1)+"`"
    d[i]= "`"+(m[i]-2)+"`"
  
  //14 `
  i++
    m[i] = random(7, 10)
    n[i] = random(2, 5)
    ex[i]= "ถ้าต้องการแจกขนม `"+m[i]+"` ชิ้นที่แตกต่างกันให้กับเด็ก `"+n[i]+"` คน จะมีวิธีแจกขนมให้เด็กกี่วิธี โดยแจกไม่ซ้ำคนเดิม"
    a[i]= "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
    b[i]= "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
    c[i]= "`"+(m[i]*n[i])+"`"
    d[i]= "`"+(m[i]+n[i])+"`"
  
  //15 `
  i++
   m[i] = random(7, 10)
   n[i] = random(2, 5)
  ex[i] = "	ถ้ามีหนังสืออยู่ `"+m[i]+"` เล่ม และต้องการนำหนังสือมาจัดเรียงเป็นแถวบนโต๊ะ `"+n[i]+"` เล่ม จะจัดหนังสือได้กี่วิธี "
   a[i] = "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
   b[i] = "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
   c[i] = "`"+(m[i]*n[i])+"`"
   d[i] = "`"+(m[i]+n[i])+"`"
  
  //16 `
  i++
  m[i] = random(7, 10)
  n[i] = random(2, 5)
    ex[i]= "หนังสือ `"+m[i]+"` เล่มที่แตกต่างกัน เลือกมาเรียงเป็นแนวตรงบนชั้นครั้งละ `"+n[i]+"` เล่ม จะจัดได้กี่วิธี<br>"+space(3)+"1. `P_("+m[i]+","+n[i]+")`<br>"+space(3)+"2. `C_("+m[i]+","+n[i]+")`<br>"+space(3)+"3. `(("+m[i]+"),("+n[i]+"))`"
    a[i] = "มีข้อถูก `\\ 1\\ ` ข้อ"
    b[i] = "มีข้อถูก `\\ 2\\ ` ข้อ"
    c[i] = "มีข้อถูก `\\ 3\\ ` ข้อ"
    d[i] = "ไม่มีข้อใดถูก"
  
  //17 `
  i++
  m[i] = random(7, 10)
  n[i] = random(2, 5)
    ex[i]= "หนังสือ `"+m[i]+"` เล่มที่แตกต่างกัน เลือกมาเรียงเป็นแนวตรงบนชั้นครั้งละ `"+n[i]+"` เล่ม จะจัดได้กี่วิธี"
    a[i] = "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
    c[i] = "`"+(m[i]*n[i])+"`"
    d[i] = "`"+(m[i]+n[i])+"`"

  //18 `
  i++
    ex[i]= "ในการเรียงลำดับตัวอักษร `A, B, C, a, b` โดยที่เริ่มต้นและลงท้ายด้วยตัวอักษรใหญ่ โดยไม่ใช้ตัวอักษรซ้ำกันเลยจะทำได้กี่วิธี (คำเหล่านี้ไม่จำเป็นต้องมีความหมาย)"
    a[i] = "`36\\ ` วิธี"
    b[i] = "`12\\ ` วิธี"
    c[i] = "`72\\ ` วิธี"
    d[i] = "`120\\ ` วิธี"

  //19 `
  i++
  m[i] = random(2, 5)
  n[i] = random(6, 9)
  o[i] = random(2, 5)
    ex[i]= "จงหาค่า `n` เมื่อ `"+m[i]+"C_(n,"+o[i]+") = "+(m[i]*Cnr(n[i],o[i]).toLocaleString())+"`"
    a[i] = "`"+n[i].toLocaleString()+"`"
    b[i] = "`"+m[i].toLocaleString()+"`"
    c[i] = "`"+o[i].toLocaleString()+"`"
    d[i] = "`"+(m[i]+n[i])+"`"

  //20 `
  i++
  m[i] = random(6, 9)
  n[i] = random(2, 5)
  o[i] = random(2, 5)

    ex[i]= "ถ้า`((n),("+n[i]+"))   = "+Cnr(m[i],n[i]).toLocaleString()+"` แล้วข้อใดมีค่าตรงกับ `P_(n,"+o[i]+")`"
    a[i] = "`"+Pnr(m[i],o[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(m[i],o[i]).toLocaleString()+"`"
    c[i] = "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
    d[i] = "`"+Pnr(n[i],o[i]).toLocaleString()+"`"

  //21 `
  i++
    m[i] = random(4, 12)
   ex[i] = "สนามกีฬาแห่งหนึ่งมีประตู เข้า - ออก ทั้งหมด `"+m[i]+"` ประตู ถ้านารีต้องการเข้าและออกจากสนามกีฬาแห่งนี้ โดยที่ถ้าเข้าประตูใด จะต้องไม่ออกประตูเดิมที่เข้ามา นารีมีวิธีเข้าและออกจากสนามกีฬาแห่งนี้กี่วิธี"
    a[i] = "`"+Pnr(m[i],2).toLocaleString()+"`"
    b[i] = "`"+Cnr(m[i],2).toLocaleString()+"`"
    c[i] = "`"+(m[i]*2).toLocaleString()+"`"
    d[i] = "`"+(m[i]).toLocaleString()+"`"

  //22 `
  i++
    m[i] = random(2, 9)
    n[i] = random(2, 9)
   ex[i] = "มีถนนจาก เลย ถึง พิษณุโลก อยู่ `"+m[i]+"` สาย และมีถนนจาก พิษณุโลก ถึง พิจิตรอยู่ `"+n[i]+"` สาย ถ้าจะขับรถยนต์จาก เลย ถึง พิจิตร โดยขับผ่าน พิษณุโลกจะใช้เส้นทางที่แตกต่างกันได้ทั้งหมดกี่เส้นทาง"
    a[i] = "`"+(m[i]*n[i]).toLocaleString()+"`"
    b[i] = "`"+(m[i]*n[i]+10).toLocaleString()+"`"
    c[i] = "`"+(m[i]+n[i]+10).toLocaleString()+"`"
    d[i] = "`"+(m[i]+n[i]).toLocaleString()+"`"

  //23 `
  i++
    m[i] = random(3, 6)
   ex[i] = "ถ้านำตัวอักษร `"+m[i]+"` ตัว จากคำว่า STANDARD มาจัดเรียงเป็นคำใหม่ โดยไม่คำนึงถึงความหมายจะจัดได้คำต่างๆ  กันทั้งหมดเท่ากับกี่คำ"
    a[i] = "`"+Pnr(8,m[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(8,m[i]).toLocaleString()+"`"
    c[i] = "`"+(m[i]*8).toLocaleString()+"`"
    d[i] = "`"+(m[i]+8).toLocaleString()+"`"
    
  //24 `
  i++
    m[i] = random(3, 5)
    n[i] = random(7, 10)
   ex[i] = "จะเลือกนักบาสเกตบอลทีมโรงเรียน `"+m[i]+"` คน จากนักบาสเกตบอลที่มาสมัครทั้งหมด `"+n[i]+"` คน  ทั้ง `"+n[i]+"` คน สามารถเล่นในตำแหน่งใดก็ได้ จะมีวิธีเลือกนับาสเกตบอลทีมโรงเรียนเท่ากับกี่วิธี"
    a[i] = "`"+Pnr(n[i],m[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(n[i],m[i]).toLocaleString()+"`"
    c[i] = "`"+(n[i]*m[i]).toLocaleString()+"`"
    d[i] = "`"+(n[i]+m[i]).toLocaleString()+"`"

 //25 `
 i++
   ex[i]= "ในการโยนเหรียญ `3` เหรียญ `1` ครั้ง ความน่าจะเป็นที่เหรียญขึ้นหัวอย่างมาก `2` เหรียญ ตรงกับข้อใด"
   a[i] = "`7/8`"
   b[i] = "`6/8`"
   c[i] = "`1`"
   d[i] = "`0`"
 
 //26 `
 i++
   ex[i]= "ข้อใดผิด"
   a[i] = "ความน่าจะเป็นของเหตุการณ์ใดๆ มีค่าตั้งแต่ 0 แต่น้อยกว่า 1"
   b[i] = "ความน่าจะเป็นของเหตุการณ์ใดๆทั้งที่ผลที่จะเกิดแต่ละตัวมีโอกาสเกิดขึ้นเท่าๆ กัน"
   c[i] = "ความน่าจะเป็นของเหตุการณ์ใดๆ เท่ากับจำนวนที่เกิดขึ้นในเหตุการณ์นั้นๆหารด้วยจำนวนผลทั้งหมด ที่ได้จากการทดลองสุ่ม"
   d[i] = "ความน่าจะเป็นของเหตุการณ์ที่เป็นไปไม่ได้มีค่าเป็น 0"

 //27 `
 i++
   ex[i]= "ครอบครัวหนึ่งต้องการมีบุตร `3` คน ความน่าจะเป็นที่ครอบครัวนั้นมีบุตรคนแรกเป็นหญิง และคนสุดท้ายเป็นชาย"
   a[i] = "`1/4`"
   b[i] = "`1/2`"
   c[i] = "`1/8`"
   d[i] = "`3/8`"

//28 `
 i++
   ex[i]= "ครอบครัวหนึ่งต้องการมีบุตร `3` คน ความน่าจะเป็นที่ไม่ได้บุตรชายตรงกับข้อใด"
   a[i] = "`1/8`"
   b[i] = "`1/2`"
   c[i] = "`1/4`"
   d[i] = "`3/8`"

//29 `
 i++
   ex[i]= "ในการโยนลูกเต๋า `2` ลูก `1` ครั้ง ความน่าจะเป็นที่ลูกเต๋าลูกแรกมีแต้มมากกว่าลูกที่สอง ตรงกับข้อใด"
   a[i] = "`5/12`"
   b[i] = "`1/6`"
   c[i] = "`5/9`"
   d[i] = "`2/3`"

//30 `
 i++
   ex[i]= "ในการโยนลูกเต๋า `2` ลูก `1` ครั้ง ความน่าจะเป็นที่ผลคูณแต้มลูกเต๋าเป็นจำนวนเฉพาะ ตรงกับข้อใด"
   a[i] = "`1/9`"
   b[i] = "`5/9`"
   c[i] = "`5/12`"
   d[i] = "`2/3`"

//31 `
 i++
   ex[i]= "ทอดลูกเต๋า 2  ลูก 1 ครั้ง ความน่าจะเป็นที่จะได้ผลรวมของแต้มบนลูกเต๋าเป็น 6 หรือ 12 มีค่าเท่าใด"
   a[i] = "`1/6`"
   b[i] = "`1/2`"
   c[i] = "`5/6`"
   d[i] = "`2/3`"

//32 `
 i++
   ex[i]= "ไพ่สำรับหนึ่งมี 52 ใบ สุ่มหยิบไพ่มา 1 ใบ ความน่าจะเป็นที่ได้ K หรือโพดำ"
   a[i] = "`4/13`"
   b[i] = "`5/13`"
   c[i] = "`17/52`"
   d[i] = "`16/52`"

//33 `
 i++
   ex[i]= "ในการตรวจสอบสภาพไฟ 3 หลอด ว่าเป็นหลอดดีหรือหลอดเสีย ความน่าจะเป็นของการตรวจพบหลอดดี 2 หลอด และหลอดเสีย 1 หลอด เป็นเท่าใด"
   a[i] = "`3/8`"
   b[i] = "`2/3`"
   c[i] = "`3/8`"
   d[i] = "`1/2`"

//34 `
 i++
   ex[i]= "ครอบครัวหนึ่งมีบุตร 4 คน ความน่าจะเป็นที่จะมีบุตรเป็นผู้ชายอย่างน้อยที่สุดหนึ่งคนตรงกับข้อใด"
   a[i] = "`15/16`"
   b[i] = "`1/4`"
   c[i] = "`1/2`"
   d[i] = "`3/4`"

//35 `
 i++
   ex[i]= "โยนเหรียญ 1 เหรียญ จำนวน 4 ครั้ง ความน่าจะเป็นของ เหตุการณ์ที่เหรียญขึ้นหน้าหัวและก้อยจำนวนเท่ากันเท่ากับเท่าใด"
   a[i] = "`3/8`"
   b[i] = "`1/8`"
   c[i] = "`1/4`"
   d[i] = "`5/8`"

//36 `
 i++
   ex[i]= "ทอดลูกเต๋า 3 ลูก จำนวน 1 ครั้ง ความน่าจะเป็นที่ลูกเต๋า	ออกแต้มคี่ทั้ง 3 ครั้ง เท่ากับเท่าใด"
   a[i] = "`1/8`"
   b[i] = "`1/4`"
   c[i] = "`1/2`"
   d[i] = "`3/4`"

// //37 ` เก็บไว้คิดต่อ มีปัญหาเรื่อง ครน.
//  i++
//  m[i] = random(3, 5)
//  n[i] = random(2, 4)
//  l[i] = m[i]+n[i]
 
//  let p1 = Cnr(m[i],2)
//  let p2 = Cnr(n[i],2)
//  let ne = p1+p2
//  let ns = Cnr(l[i],2)
// //  let gcd = findGCD(ne,ns)
// //  let nt = ns/gcd
// //  let nb = ne/gcd

//    ex[i]= "นักเรียนกลุ่มหนึ่งมี `"+l[i]+"` คน เป็นนักเรียนหญิง `"+m[i]+"` คน ถ้าสุ่มเลือกนักเรียนกลุ่มนี้ครั้งละ `2` คน ความน่าจะเป็นที่จะได้นักเรียนเพศเดียวกันเท่ากับเท่าใด"
//    a[i] = "`a"+ne+"/"+ns+"`"
//    b[i] = "`b"+p1+"`"
//    c[i] = "`c"+p2+"`"
//    d[i] = "`a"+ne+"/"+ns+"`"

//37 `
 i++
   ex[i]= "นักเรียนกลุ่มหนึ่งมี 10 คน เป็นนักเรียนหญิง 6 คน ถ้าสุ่มเลือกนักเรียนกลุ่มนี้ครั้งละ 2 คน ความน่าจะเป็นที่จะได้นักเรียนเพศเดียวกันเท่ากับเท่าใด"
   a[i] = "`7/15`"
   b[i] = "`1/3`"
   c[i] = "`8/15`"
   d[i] = "`2/3`"

//38 `
 i++
   ex[i]= "ในการออกสลากกาชาดมีหมายเลข 000 ถึง 999 ความน่าจะเป็นที่สลากรางวัลที่ 1 ซึ่งมี 1 รางวัล จะเป็นหมายเลขที่เรียงถัดกันเป็นเท่าใด"
   a[i] = "`1/125`"
   b[i] = "`2/125`"
   c[i] = "`8/999`"
   d[i] = "`16/999`"

//39 `
 i++
   ex[i]= "กล่องใบหนึ่งมีบัตรขนาดเท่ากัน 20 ใบ บรรจุอยู่ ซึ่งบัตรแต่ละใบมีหมายเลขกำกับบัตรละหนึ่งหมายเลข  คือ  1, 2, 3, 4, … , 20 ถ้าสุ่มหยิบบัตร 1 ใบจากกล่องใบนี้  แล้วความน่าจะเป็นที่หยิบได้บัตรที่มีหมายเลขที่หารด้วย 3 ลงตัว"
   a[i] = "`3/10`"
   b[i] = "`1/20`"
   c[i] = "`3/20`"
   d[i] = "`1/10`"

//40 `
 i++
   ex[i]= "กล่องใบหนึ่งมีลูกบอลสีแดง 2 ลูก สีขาว 2 ลูก โดยที่ลูกบอลแต่ละลูกแตกต่างกัน หยิบลูกบอลออกมา 2 ลูก โดยการหยิบทีละ 1 ลูก และใส่คืนลูกแรกก่อนที่จะหยิบลูกที่สอง จงหาความน่าจะเป็นที่ได้ลูกบอลทั้งสองเป็นสีแดง"
   a[i] = "`1/4`"
   b[i] = "`1/2`"
   c[i] = "`3/2`"
   d[i] = "`1/3`"

//41 `
 i++
   ex[i]= "กล่องใบหนึ่งมีลูกบอลสีแดง 2 ลูก สีขาว 2 ลูก โดยที่ลูกบอลแต่ละลูกแตกต่างกัน หยิบลูกบอลออกมา 2 ลูก โดยการหยิบทีละ 1 ลูก และใส่คืนลูกแรกก่อนที่จะหยิบลูกที่สอง จงหาความน่าจะเป็นที่ได้ลูกบอลทั้งสองเป็นสีแดง"
   a[i] = "`1/4`"
   b[i] = "`1/2`"
   c[i] = "`3/2`"
   d[i] = "`1/3`"
   
//42 `
i++
m[i]=random(2,9)
n[i]=random(2,9)
  ex[i]= "กล่องใบหนึ่งมีลูกบอลสีแดง `"+m[i]+"` ลูก สีขาว "+n[i]+" ลูก โดยที่ลูกบอลแต่ละลูกแตกต่างกัน หยิบลูกบอลออกมา 2 ลูก โดยการหยิบทีละ 1 ลูก และใส่คืนลูกแรกก่อนที่จะหยิบลูกที่สอง จงหาความน่าจะเป็นที่ได้ลูกบอลทั้งสองเป็นสีแดง"
  a[i] = "`1/(4^2) uarr`"
  b[i] = "`1/2`"
  c[i] = "`3/2`"
  d[i] = "`1/3`"
   
//43 `
i++
m[i]=random(2,9)
n[i]=random(2,9)
  ex[i]= "กล่องใบหนึ่งมีลูกบอลสีฟ้า `"+m[i]+"` ลูก สีขาว "+n[i]+" ลูก โดยที่ลูกบอลแต่ละลูกแตกต่างกัน หยิบลูกบอลออกมา 2 ลูก โดยการหยิบทีละ 1 ลูก และใส่คืนลูกแรกก่อนที่จะหยิบลูกที่สอง จงหาความน่าจะเป็นที่ได้ลูกบอลทั้งสองเป็นสีแดง"
  a[i] = "`1/(4^2)`"
  b[i] = "`1/2`"
  c[i] = "`3/2`"
  d[i] = "`1/3`"

