//สอบกลางภาค 662
//ตัวแปรส่วนโครงสร้างข้อสอบ
var ex = []
var  a = []
var  b = []
var  c = []
var  d = []

//ตัวแปรในข้อสอบแต่ละข้อ
var m = []
var n = []
var o = []
var r = []
var x = []
var y = []
var z = []

//1 `
let i=0
     x[i] = random(3, 9)
    ex[i] = "ลุงชมไปหาหมอในเมืองจะต้องออกจากบ้านเพื่อไปต่อรถที่ท่ารถ โดยมีวิธีเดินทางดังนี้ การเดิน ขี่จักรยาน หรือขึ้นรถสองแถว เมื่อถึงท่ารถแล้วจะมีวิธีการขึ้นรถต่อเข้าไปในเมืองคือ รถตู้ กับรถโดยสารประจำทาง การหาวิธีในการเดินทางไปหาหมอในเมืองของลุงชม เป็นการใช้กฎเกณฑ์เบื้องต้นเกี่ยวกับการนับตามข้อใด"
     a[i] = "การคูณ"
     b[i] = "การบวก"
     c[i] = "การลบ"
     d[i] = "การหาร"

//2 `
i++
   m[i] = random(2, 9)
   n[i] = random(2, 9)
  ex[i] = "ถ้ามีเสื้อที่แตกต่างกัน "+m[i]+" ตัว และกางเกงที่แตกต่างกัน "+n[i]+" ตัว จะมีวิธีการแต่งตัวได้กี่วิธี"
   a[i] = "`"+(m[i]*n[i])+"`"
   b[i] = "`"+m[i]+n[i]+"`"
   c[i] = "`"+(m[i]+n[i])+"`"
   d[i] = "`"+(m[i]*n[i]+2)+"`"

 //3 `
 i++
   m[i] = random(2, 9)
   n[i] = random(2, 9)
  ex[i] = "มีถนนจากบ้านไปโรงเรียน "+m[i]+" สาย และมีถนนจากโรงเรียนไปวัด "+n[i]+" สาย ถ้าขี่จักรยานจากบ้านไปวัดโดยต้องผ่านโรงเรียน จะมีวิธีเลือกเส้นทางได้กี่วิธี"
   a[i] = "`"+(m[i]*n[i])+"`"
   b[i] = "`"+m[i]+n[i]+"`"
   c[i] = "`"+(m[i]+n[i])+"`"
   d[i] = "`"+(m[i]*n[i]+2)+"`"

 //4 `
 i++
   m[i] = random(2, 9)
   n[i] = random(2, 9)
   o[i] = random(2, 9)
  ex[i] = "รุจมีกางเกงต่างกันอยู่ "+m[i]+" ตัว เสื้อต่างกัน "+n[i]+" ตัว เนคไทต่างกัน "+o[i]+" เส้น อยากทราบว่ารุจแต่งตัวได้ทั้งหมดกี่วิธี"
   a[i] = "`"+(m[i]*n[i]*o[i])+"`"
   b[i] = "`"+m[i]+n[i]+o[i]+"`"
   c[i] = "`"+(m[i]+n[i]+o[i])+"`"
   d[i] = "`"+(m[i]*n[i]*o[i]+2)+"`"

 //5 `
 i++
   m[i] = random(2, 9)
   n[i] = random(2, 9)
   o[i] = random(2, 9)
  ex[i] = "รุจมีกางเกงต่างกันอยู่ "+m[i]+" ตัว เสื้อต่างกัน "+n[i]+" ตัว เนคไทต่างกัน "+o[i]+" เส้น อยากทราบว่ารุจแต่งตัวได้ทั้งหมดกี่วิธี"
   a[i] = "`"+(m[i]*n[i]*o[i])+"`"
   b[i] = "`"+m[i]+n[i]+o[i]+"`"
   c[i] = "`"+(m[i]+n[i]+o[i])+"`"
   d[i] = "`"+(m[i]*n[i]*o[i]+2)+"`"

  //6
  i++
  m[i] = random(3, 7)
  ex[i] = "เมื่อโยนเหรียญหนึ่งเหรียญ จำนวน "+m[i]+" ครั้ง จะได้ผลลัพธ์ต่าง ๆ กันทั้งหมดกี่วิธี"
   a[i] = "`"+(2**m[i])+"\\ `วิธี"
   b[i] = "`"+(2*m[i])+"\\ `วิธี"
   c[i] = "`"+(m[i])+"\\ `วิธี"
   d[i] = "`"+(2+m[i])+"\\ `วิธี"
  
  //7 `
  i++
  m[i] = random(5, 7)
  n[i] = m[i]-1
  ex[i] = "มีโรงแรมอยู่ "+m[i]+" แห่ง อยากทราบว่านักท่องเที่ยว "+n[i]+" คน จะเลือกพักโรงแรมดังกล่าวโดยไม่ซ้ำกันได้กี่วิธี"
   a[i] = "`"+Pnr(m[i],n[i])+"\\ `วิธี"
   b[i] = "`"+(m[i]*n[i])+"\\ `วิธี"
   c[i] = "`"+nFact(n[i])+"\\ `วิธี"
   d[i] = "`"+(nFact(m[i])/n[i])+"\\ `วิธี"
  
  //8 `
  i++
    m[i] = random(10, 20)
   ex[i] = "ข้อสอบฉบับหนึ่งเป็นแบบกาถูกผิดมีจำนวน "+m[i]+" ข้อ จงหา	จำนวนวิธีที่จะทำข้อสอบทั้งหมด"
    a[i] = "`2^"+m[i]+"`"
    b[i] = "`"+m[i]+"^2`"
    c[i] = "`"+m[i]+"xx 2`"
    d[i] = "`P_("+m[i]+",2)`"
  
  //9 `
  i++
  m[i] = random(5, 7)
  ex[i] = "ถ้าห้องประชุมแห่งหนึ่งมีทางเข้าออก "+m[i]+" ประตู ชายคนหนึ่งเข้า	ออกประตูวันละครั้ง โดยมีเงื่อนไขว่าการเข้าออกประตูห้ามซ้ำกัน จะเข้าออกได้กี่วิธี"
   a[i] = "`"+Pnr(m[i],2)+"\\ `วิธี"
   b[i] = "`"+(m[i]*2)+"\\ `วิธี"
   c[i] = "`"+m[i]+"\\ `วิธี"
   d[i] = "`"+(nFact(m[i]))+"\\ `วิธี"
  
  //10 `
  i++
    m[i] = random(2, 20)
    n[i] = random(2, 20)
    ex[i]= "นักเรียนคนหนึ่งแข่งขันตอบปัญหาชนะจะได้รางวัล 1 ชิ้น โดยมีของรางวัลให้เลือกเป็นกระติกน้ำมี "+m[i]+" แบบหรือเป็นถุงผ้า "+n[i]+" แบบ นักเรียนคนนี้จะเลือกรางวัลได้กี่แบบ"
    a[i]= "`"+(m[i]+n[i])+"\\ `แบบ"
    b[i]= "`"+(m[i]*n[i])+"\\ `แบบ"
    c[i]= "`1 \\ `แบบ"
    d[i]= "`2 \\ `แบบ"
  
  //11 `
  i++
    m[i] = random(2, 9)
    n[i] = random(2, 4)
    r[i] = m[i]*n[i]
    ex[i]= "ข้อใดเท่ากับ `("+r[i]+"!)/("+m[i]+"!)`"
    a[i]= "`"+mnFactDp(r[i],m[i],'xx')+" `"
    b[i]= "`"+mnFactDp(r[i],m[i],'xx')+"! `"
    c[i]= "`"+mnFactDp(r[i],m[i],'+')+"! `"
    d[i]= "`"+mnFactDp(r[i],m[i],'+')+" `"
  
  //12 `
  i++
    m[i] = random(2, 7)
    n[i] = random(2, 7)
    ex[i]= "จงหา xy เมื่อ x! = "+nFact(m[i])+" และ y! = "+nFact(n[i])+" "
    a[i]= "`"+(m[i]*n[i])+"`"
    b[i]= "`"+(m[i]*n[i]+5)+"`"
    c[i]= "`"+(m[i]*n[i]+10)+"`"
    d[i]= "`"+(m[i]*n[i]+15)+"`"

  //13 `
  i++
    m[i] = random(7, 15)
    ex[i]= "จงหาค่า `n` เมื่อ `n(n-1)(n-2) = "+m[i]*(m[i]-1)*(m[i]-2)+"`"
    a[i]= "`"+m[i]+"`"
    b[i]= "`"+(m[i]+1)+"`"
    c[i]= "`"+(m[i]-1)+"`"
    d[i]= "`"+(m[i]-2)+"`"
  
  //14 `
  i++
    m[i] = random(7, 10)
    n[i] = random(2, 5)
    ex[i]= "ถ้าต้องการแจกขนม `"+m[i]+"` ชิ้นที่แตกต่างกันให้กับเด็ก `"+n[i]+"` คน จะมีวิธีแจกขนมให้เด็กกี่วิธี โดยแจกไม่ซ้ำคนเดิม"
    a[i]= "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
    b[i]= "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
    c[i]= "`"+(m[i]*n[i])+"`"
    d[i]= "`"+(m[i]+n[i])+"`"
  
  //15 `
  i++
   m[i] = random(7, 10)
   n[i] = random(2, 5)
  ex[i] = "	ถ้ามีหนังสืออยู่ `"+m[i]+"` วิชา และต้องการนำหนังสือมาจัดเรียงเป็นแถวบนโต๊ะ `"+n[i]+"` เล่ม จะจัดหนังสือได้กี่วิธี "
   a[i] = "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
   b[i] = "`"+Cnr(m[i],n[i]).toLocaleString()+"`"
   c[i] = "`"+(m[i]*n[i])+"`"
   d[i] = "`"+(m[i]+n[i])+"`"
  
  //16 `
  i++
  m[i] = random(7, 10)
  n[i] = random(2, 5)
    ex[i]= "หนังสือ `"+m[i]+"` เล่มที่แตกต่างกัน เลือกมาเรียงเป็นแนวตรงบนชั้นครั้งละ `"+n[i]+"` เล่ม จะจัดได้กี่วิธี<br>"+space(3)+"1. `P_("+m[i]+","+n[i]+")`<br>"+space(3)+"2. `C_("+m[i]+","+n[i]+")`<br>"+space(3)+"3. `(("+m[i]+"),("+n[i]+"))`"
    a[i] = "มีข้อถูก `\\ 1\\ ` ข้อ"
    b[i] = "มีข้อถูก `\\ 2\\ ` ข้อ"
    c[i] = "มีข้อถูก `\\ 3\\ ` ข้อ"
    d[i] = "ไม่มีข้อใดถูก"
  
  //17 `
  i++
  m[i] = random(7, 10)
  n[i] = random(2, 5)
    ex[i]= "หนังสือ `"+m[i]+"` เล่มที่แตกต่างกัน เลือกมาเรียงเป็นแนวตรงบนชั้นครั้งละ `"+n[i]+"` เล่ม จะจัดได้กี่วิธี"
    a[i] = "`a"+Pnr(m[i],n[i]).toLocaleString()+"`"
    b[i] = "`b"+Cnr(m[i],n[i]).toLocaleString()+"`"
    c[i] = "`c"+(m[i]*n[i])+"`"
    d[i] = "`d"+(m[i]+n[i])+"`"

  //18 `
  i++
  m[i] = random(7, 10)
  n[i] = random(2, 5)
    ex[i]= "สร้างจำนวนคู่สามหลักโดยในแต่ละหลักไม่ซ้ำกันจาก เลขโดด 0, 1, 2 และ 5 ได้กี่วิธี"
    a[i] = "`(3 xx 2) + (2 xx 2)\\ ` วิธี"
    b[i] = "`(3 + 2) + (2 + 2)\\ ` วิธี"
    c[i] = "`3xx2xx1\\ ` วิธี"
    d[i] = "`4xx3xx2xx1\\ ` วิธี"

  //19 `
  i++
  m[i] = random(2, 5)
  n[i] = random(6, 9)
  o[i] = random(2, 5)
    ex[i]= "จงหาค่า `n` เมื่อ `"+m[i]+"C_(n,"+o[i]+") = "+(m[i]*Cnr(n[i],o[i]).toLocaleString())+"`"
    a[i] = "`"+n[i].toLocaleString()+"`"
    b[i] = "`"+m[i].toLocaleString()+"`"
    c[i] = "`"+o[i].toLocaleString()+"`"
    d[i] = "`"+(m[i]+n[i])+"`"

  //20 `
  i++
  m[i] = random(6, 9)
  n[i] = random(2, 5)
  o[i] = random(2, 5)

    ex[i]= "ถ้า`((n),("+n[i]+"))   = "+Cnr(m[i],n[i]).toLocaleString()+"` แล้วข้อใดมีค่าตรงกับ `P_(n,"+o[i]+")`"
    a[i] = "`"+Pnr(m[i],o[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(m[i],o[i]).toLocaleString()+"`"
    c[i] = "`"+Pnr(m[i],n[i]).toLocaleString()+"`"
    d[i] = "`"+Pnr(n[i],o[i]).toLocaleString()+"`"

  //21 `
  i++
    m[i] = random(1, 9)*10
   ex[i] = "บัตรเข้าชมภาพยนตร์ของโรงหนังแห่งหนึ่งกำหนดหมายเลขที่นั่งเข้าชมโดยใช้หมายเลข `1-"+m[i]+"` และตัวอักษรภาษาอังกฤษ A-O ตัวอย่างเช่น 1A"
    a[i] = "`"+(m[i]*15).toLocaleString()+"`"
    b[i] = "`"+(m[i]+15).toLocaleString()+"`"
    c[i] = "`"+m[i].toLocaleString()+"`"
    d[i] = "`15`"

  //22 `
  i++
    m[i] = random(4, 9)
    n[i] = random(3, 9)
    o[i] = random(2, 9)
   ex[i] = "บี้ต้องการเดินทางไปเชียงใหม่ ซึ่งสามารถไปได้โดยขึ้นรถทัวร์ รถไฟ และเครื่องบิน ถ้าในวันหนึ่ง ๆ มีรถทัวร์ไปเชียงใหม่ `"+m[i]+"` เที่ยว รถไฟ `"+n[i]+"` เที่ยว และเครื่องบิน `"+o[i]+"` เที่ยว บี้มีวิธีในการเดินทางไปเชียงใหม่ได้แตกต่างทั้งหมดเท่ากับกี่วิธี"
    a[i] = "`"+(m[i]+n[i]+o[i]).toLocaleString()+"`"
    b[i] = "`"+(m[i]*n[i]*o[i]).toLocaleString()+"`"
    c[i] = "`"+(m[i]*n[i]+o[i]).toLocaleString()+"`"
    d[i] = "`"+(m[i]+n[i]*o[i]).toLocaleString()+"`"

  //23 `
  i++
    m[i] = random(3, 6)
   ex[i] = "ถ้านำตัวอักษร `"+m[i]+"` ตัว จากคำว่า STANDARD มาจัดเรียงเป็นคำใหม่ โดยไม่คำนึงถึงความหมายจะจัดได้คำต่างๆ  กันทั้งหมดเท่ากับกี่คำ"
    a[i] = "`"+Pnr(8,m[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(8,m[i]).toLocaleString()+"`"
    c[i] = "`"+(m[i]*8).toLocaleString()+"`"
    d[i] = "`"+(m[i]+8).toLocaleString()+"`"
    
  //24 `
  i++
    m[i] = random(3, 5)
    n[i] = random(7, 10)
   ex[i] = "จะเลือกนักบาสเกตบอลทีมโรงเรียน `"+m[i]+"` คน จากนักบาสเกตบอลที่มาสมัครทั้งหมด `"+n[i]+"` คน  ทั้ง `"+n[i]+"` คน สามารถเล่นในตำแหน่งใดก็ได้ จะมีวิธีเลือกนับาสเกตบอลทีมโรงเรียนเท่ากับกี่วิธี"
    a[i] = "`"+Pnr(n[i],m[i]).toLocaleString()+"`"
    b[i] = "`"+Cnr(n[i],m[i]).toLocaleString()+"`"
    c[i] = "`"+(n[i]*m[i]).toLocaleString()+"`"
    d[i] = "`"+(n[i]+m[i]).toLocaleString()+"`"
